## Creating Series

In [3]:
# Importing libraries
import pandas as pd

In [9]:
house_series = pd.Series(["Beedroom", "Living Room", "Bathroom"])
house_series

0       Beedroom
1    Living Room
2       Bathroom
dtype: object

In [10]:
colours_series = pd.Series(["Black", "Brown", "White"])
colours_series

0    Black
1    Brown
2    White
dtype: object

## Creating DataFrames

In [11]:
# Creating DataFrames
dataframe = pd.DataFrame("Rooms": house_series, "Colour": colours_series);
dataframe

SyntaxError: invalid syntax (3169813693.py, line 2)

## Correction of the cell above

Dataframe takes dictionaries as parameter, so we need to pass a dictionary as argument, that was what led the error in the cell above

In [12]:
dataframe = pd.DataFrame({"Room": house_series, "Colour": colours_series})
dataframe

          Room Colour
0     Beedroom  Black
1  Living Room  Brown
2     Bathroom  White

# Replicating car-sales.csv dataframe manually

Trying to consolidate series and dataframes replicating car-sales.csv file manually

### It should look something like this

In [13]:
df = pd.read_csv("../car-sales.csv")
df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [14]:
# Creating Series
make = pd.Series(["Toyota", "Honda", "Toyota", "BMW", "Nissan", "Toyota",
                  "Honda", "Honda", "Toyota", "Nissan"])

colour = pd.Series(["White", "Red", "Blue", "Black", "White", "Green",
                    "Blue", "Blue", "White", "White"])

odometer = pd.Series([150043, 87899, 32549, 11179, 213095, 99213,
                      45968, 54738, 60000, 31600])

doors = pd.Series([4, 4, 3, 5, 4, 4, 4, 4, 4, 4])

price = pd.Series(["$4,000.00", "$5,000.00", "$7,000.00", "$22,000.00",
                   "$3,500.00", "$4,500.00", "$7,500.00", "$7,000.00",
                   "$6,250.00", "$9,700.00"])

In [16]:
# Creating DataFrame

car_sales_manual = pd.DataFrame({"Make": make, "Colour": colour, "Odometer (KM)": odometer, "Doors": doors, "Price": price})
car_sales_manual

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45968      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Comparing Results

In [20]:
df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [21]:
car_sales_manual

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45968      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00